{
  "subject": "Ecology and Evolution",
  "subject_key": "ecology_and_evolution",
  "topics": [
    {
      "topic": "Fundamental Concepts",
      "topic_key": "fundamental_concepts",
      "lessons": [
        {
          "lesson": "Abiotic and biotic components of ecological systems",
          "lesson_key": "abiotic_and_biotic_components_of_ecological_systems",
          "chapters": [
            {
              "chapter": "Differentiate abiotic from biotic components with exam-relevant examples."
            },
            {
              "chapter": "Explain how abiotic factors limit organism performance and distribution."
            },
            {
              "chapter": "Explain how biotic interactions modify distributions and abundances."
            },
            {
              "chapter": "Connect components to measurable ecological variables (e.g., temperature, biomass, interaction strength)."
            }
          ]
        },
        {
          "lesson": "Scales of ecological organization: population to biome",
          "lesson_key": "scales_of_ecological_organization_population_to_biome",
          "chapters": [
            {
              "chapter": "Define population, species, community, ecosystem, and biome with clear boundaries and examples."
            },
            {
              "chapter": "Identify the typical questions, variables, and processes studied at each scale."
            },
            {
              "chapter": "Map a real-world scenario (e.g., a lake, forest patch) onto the correct organizational level(s)."
            },
            {
              "chapter": "Explain cross-scale linkages (bottom-up and top-down) in ecological reasoning."
            }
          ]
        },
        {
          "lesson": "Niches and habitats: concepts, differences, and applications",
          "lesson_key": "niches_and_habitats_concepts_differences_and_applications",
          "chapters": [
            {
              "chapter": "Distinguish habitat (place) from niche (role + requirements) using precise language."
            },
            {
              "chapter": "Explain the niche as a multidimensional concept and relate it to resource use and environmental conditions."
            },
            {
              "chapter": "Differentiate fundamental and realized niches and predict the role of competition/predation."
            },
            {
              "chapter": "Apply niche concepts to coexistence, habitat selection, and species distribution questions."
            }
          ]
        },
        {
          "lesson": "Integration module: linking components, scale, niche, and habitat",
          "lesson_key": "integration_module_linking_components_scale_niche_and_habitat",
          "chapters": [
            {
              "chapter": "Integrate abiotic/biotic components with scale-dependent patterns."
            },
            {
              "chapter": "Construct a coherent explanation for species presence/absence using niche and habitat."
            },
            {
              "chapter": "Translate narrative ecological scenarios into testable statements at the correct scale."
            },
            {
              "chapter": "Prepare for GATE-style mixed-concept MCQs and short analytical prompts."
            }
          ]
        }
      ]
    },
    {
      "topic": "Population Ecology",
      "topic_key": "population_ecology",
      "lessons": [
        {
          "lesson": "Population growth rates and regulation",
          "lesson_key": "population_growth_rates_and_regulation",
          "chapters": [
            {
              "chapter": "Compute and interpret growth rates using per-capita and finite-rate language."
            },
            {
              "chapter": "Differentiate density-dependent and density-independent factors using ecological examples."
            },
            {
              "chapter": "Explain how regulation produces stability, cycles, or crashes depending on feedback and time lags."
            },
            {
              "chapter": "Apply exponential vs logistic reasoning to typical GATE problem statements."
            }
          ]
        },
        {
          "lesson": "Metapopulation ecology: patches, colonization, persistence, extinction",
          "lesson_key": "metapopulation_ecology_patches_colonization_persistence_extinction",
          "chapters": [
            {
              "chapter": "Define metapopulation structure and explain when the concept applies."
            },
            {
              "chapter": "Describe patch occupancy dynamics using colonization and extinction processes."
            },
            {
              "chapter": "Explain how patch size/quality and isolation affect persistence."
            },
            {
              "chapter": "Interpret sources and sinks and predict consequences of habitat loss or fragmentation."
            }
          ]
        },
        {
          "lesson": "Age-structured populations: life tables and projection models",
          "lesson_key": "age_structured_populations_life_tables_and_projection_models",
          "chapters": [
            {
              "chapter": "Explain why age structure changes population growth beyond simple \\\\(N\\\\)-based models."
            },
            {
              "chapter": "Construct and interpret basic life tables using age-specific survival and fecundity."
            },
            {
              "chapter": "Relate survivorship patterns to population dynamics and conservation risk."
            },
            {
              "chapter": "Understand Leslie matrix logic and interpret the meaning of the dominant growth factor."
            }
          ]
        },
        {
          "lesson": "Integration module: regulation, spatial structure, and demography",
          "lesson_key": "integration_module_regulation_spatial_structure_and_demography",
          "chapters": [
            {
              "chapter": "Connect density dependence with metapopulation persistence under fragmentation."
            },
            {
              "chapter": "Explain how age structure alters extinction risk in small patches."
            },
            {
              "chapter": "Recognize when stochasticity dominates dynamics and how the rescue effect mitigates it."
            },
            {
              "chapter": "Solve mixed-concept questions combining growth models, patches, and demography."
            }
          ]
        }
      ]
    },
    {
      "topic": "Interactions",
      "topic_key": "interactions",
      "lessons": [
        {
          "lesson": "Interaction types: definitions, mechanisms, and exam classification",
          "lesson_key": "interaction_types_definitions_mechanisms_and_exam_classification",
          "chapters": [
            {
              "chapter": "Classify interspecific interactions using fitness-effect sign notation."
            },
            {
              "chapter": "Distinguish symbiosis from mutualism and explain common misconceptions."
            },
            {
              "chapter": "Differentiate competition types (exploitative vs interference) with examples."
            },
            {
              "chapter": "Explain why interaction outcomes can change with context (environment and density)."
            }
          ]
        },
        {
          "lesson": "Ecophysiology: physiological adaptations to abiotic environments",
          "lesson_key": "ecophysiology_physiological_adaptations_to_abiotic_environments",
          "chapters": [
            {
              "chapter": "Explain how abiotic factors constrain organism performance through physiology."
            },
            {
              "chapter": "Differentiate adaptation from acclimation using clear criteria."
            },
            {
              "chapter": "Relate physiological mechanisms to ecological distribution limits (range edges, microhabitats)."
            },
            {
              "chapter": "Interpret qualitative graphs such as tolerance ranges and thermal performance curves."
            }
          ]
        },
        {
          "lesson": "Predator-prey dynamics: Lotka-Volterra and key extensions",
          "lesson_key": "predator_prey_dynamics_lotka_volterra_and_key_extensions",
          "chapters": [
            {
              "chapter": "Write and interpret the Lotka-Volterra predator-prey equations and parameter meanings."
            },
            {
              "chapter": "Explain the assumptions behind the classic model and the qualitative behavior (cycles, phase lag)."
            },
            {
              "chapter": "Use nullclines and equilibrium reasoning to interpret stability qualitatively."
            },
            {
              "chapter": "Explain how functional responses and carrying capacity modify predictions."
            }
          ]
        },
        {
          "lesson": "Integration module: interactions meet physiology and dynamics",
          "lesson_key": "integration_module_interactions_meet_physiology_and_dynamics",
          "chapters": [
            {
              "chapter": "Connect abiotic stress with shifts in interaction outcomes (e.g., competition vs facilitation)."
            },
            {
              "chapter": "Explain how physiology affects interaction strength (e.g., temperature-dependent predation rates)."
            },
            {
              "chapter": "Synthesize multi-species outcomes including indirect effects (apparent competition, trophic cascades)."
            },
            {
              "chapter": "Answer mixed GATE questions combining interaction type identification and dynamical intuition."
            }
          ]
        }
      ]
    },
    {
      "topic": "Community Ecology",
      "topic_key": "community_ecology",
      "lessons": [
        {
          "lesson": "Community assembly and organization",
          "lesson_key": "community_assembly_and_organization",
          "chapters": [
            {
              "chapter": "Define community assembly and identify key assembly filters (dispersal, abiotic, biotic)."
            },
            {
              "chapter": "Explain how species pools and historical contingency affect local communities."
            },
            {
              "chapter": "Describe community organization using trophic structure, guilds, and dominance patterns."
            },
            {
              "chapter": "Predict qualitative effects of changing dispersal or environmental stress on composition."
            }
          ]
        },
        {
          "lesson": "Succession: mechanisms, patterns, and predictions",
          "lesson_key": "succession_mechanisms_patterns_and_predictions",
          "chapters": [
            {
              "chapter": "Differentiate primary and secondary succession with examples."
            },
            {
              "chapter": "Describe typical successional trends in species composition and ecosystem properties."
            },
            {
              "chapter": "Compare facilitation, tolerance, and inhibition models and infer which fits a scenario."
            },
            {
              "chapter": "Relate disturbance regimes to successional stage mosaics and diversity patterns."
            }
          ]
        },
        {
          "lesson": "Richness, evenness, and diversity indices",
          "lesson_key": "richness_evenness_and_diversity_indices",
          "chapters": [
            {
              "chapter": "Define species richness and evenness and explain why both matter."
            },
            {
              "chapter": "Compute and interpret common diversity indices conceptually (Shannon, Simpson) from relative abundance patterns."
            },
            {
              "chapter": "Use rank-abundance curves to compare communities by dominance and evenness."
            },
            {
              "chapter": "Recognize sampling effects and the need for rarefaction when comparing richness."
            }
          ]
        },
        {
          "lesson": "Species-area relationships (SAR): scaling richness with area",
          "lesson_key": "species_area_relationships_sar_scaling_richness_with_area",
          "chapters": [
            {
              "chapter": "State and interpret the SAR form \\(S = cA^z\\) and the meaning of parameters \\(c\\) and \\(z\\)."
            },
            {
              "chapter": "Explain ecological drivers of SAR (habitat diversity, sampling, isolation, extinction)."
            },
            {
              "chapter": "Use SAR reasoning to predict qualitative changes in richness under habitat loss."
            },
            {
              "chapter": "Distinguish SAR from island-biogeography equilibrium logic while connecting the two."
            }
          ]
        },
        {
          "lesson": "Island biogeography: equilibrium theory and predictions",
          "lesson_key": "island_biogeography_equilibrium_theory_and_predictions",
          "chapters": [
            {
              "chapter": "Explain the colonization-extinction balance underlying equilibrium species richness."
            },
            {
              "chapter": "Predict how island area and isolation shift colonization and extinction rates."
            },
            {
              "chapter": "Interpret the equilibrium model graphically (rate curves and \\(S^*\\))."
            },
            {
              "chapter": "Apply the theory to habitat fragments and reserve design concepts at a qualitative level."
            }
          ]
        }
      ]
    },
    {
      "topic": "Ecosystems Structure and Function",
      "topic_key": "ecosystems_structure_and_function",
      "lessons": [
        {
          "lesson": "Ecosystem structure: compartments, trophic levels, and food webs",
          "lesson_key": "ecosystem_structure_compartments_trophic_levels_and_food_webs",
          "chapters": [
            {
              "chapter": "Define ecosystem structure in terms of compartments, pools, and standing stocks."
            },
            {
              "chapter": "Identify trophic levels and distinguish food chains from food webs."
            },
            {
              "chapter": "Explain trophic interactions using top-down and bottom-up perspectives."
            },
            {
              "chapter": "Predict qualitative consequences of adding/removing a trophic level (e.g., trophic cascades)."
            }
          ]
        },
        {
          "lesson": "Nutrient cycles: pools, fluxes, and key transformations",
          "lesson_key": "nutrient_cycles_pools_fluxes_and_key_transformations",
          "chapters": [
            {
              "chapter": "Differentiate energy flow from nutrient cycling conceptually."
            },
            {
              "chapter": "Describe major pools and fluxes in carbon, nitrogen, and phosphorus cycles."
            },
            {
              "chapter": "Explain biologically important transformations (e.g., N fixation, nitrification, denitrification; P mineralization)."
            },
            {
              "chapter": "Relate nutrient availability to ecosystem functioning and limitation."
            }
          ]
        },
        {
          "lesson": "Primary productivity: GPP, NPP, controls, and measurement",
          "lesson_key": "primary_productivity_gpp_npp_controls_and_measurement",
          "chapters": [
            {
              "chapter": "Define GPP and NPP and explain their relationship."
            },
            {
              "chapter": "Identify the main controls on primary productivity (light, water, temperature, nutrients)."
            },
            {
              "chapter": "Interpret productivity patterns across ecosystems and seasons qualitatively."
            },
            {
              "chapter": "Understand common measurement approaches conceptually (biomass harvest, oxygen methods, eddy covariance)."
            }
          ]
        },
        {
          "lesson": "Secondary productivity: consumer energetics and transfer across trophic levels",
          "lesson_key": "secondary_productivity_consumer_energetics_and_transfer_across_trophic_levels",
          "chapters": [
            {
              "chapter": "Define secondary productivity and distinguish production from assimilation and ingestion."
            },
            {
              "chapter": "Explain why transfer efficiency is typically low and variable."
            },
            {
              "chapter": "Relate food quality and stoichiometry to consumer production."
            },
            {
              "chapter": "Predict how changes in primary productivity propagate to higher trophic levels."
            }
          ]
        },
        {
          "lesson": "Integration module: linking trophic structure, nutrient cycling, and productivity",
          "lesson_key": "integration_module_linking_trophic_structure_nutrient_cycling_and_productivity",
          "chapters": [
            {
              "chapter": "Integrate nutrient limitation with primary productivity and food-web structure."
            },
            {
              "chapter": "Explain how decomposition connects productivity to nutrient availability."
            },
            {
              "chapter": "Predict ecosystem responses to enrichment (eutrophication) or nutrient loss qualitatively."
            },
            {
              "chapter": "Solve mixed questions connecting trophic interactions, cycles, and productivity measures."
            }
          ]
        }
      ]
    },
    {
      "topic": "History of Evolutionary Thought",
      "topic_key": "history_of_evolutionary_thought",
      "lessons": [
        {
          "lesson": "Pre-Darwinian and Lamarckian Evolutionary Thought",
          "lesson_key": "pre_darwinian_and_lamarckian_evolutionary_thought",
          "chapters": [
            {
              "chapter": "Place Lamarckism in its historical context and articulate why it was compelling before genetics."
            },
            {
              "chapter": "Explain the mechanisms proposed by Lamarck: use and disuse, inheritance of acquired characters, and inherent drive toward complexity."
            },
            {
              "chapter": "Evaluate Lamarckism using modern biological knowledge, distinguishing what was incorrect from what was prescient."
            },
            {
              "chapter": "Recognize common exam traps (teleology, individual-level change) and correct them with population thinking."
            }
          ]
        },
        {
          "lesson": "Darwinism: Natural Selection and Common Descent",
          "lesson_key": "darwinism_natural_selection_and_common_descent",
          "chapters": [
            {
              "chapter": "State Darwin’s postulates for natural selection and derive how they imply adaptive evolution."
            },
            {
              "chapter": "Differentiate Darwin’s explanations (selection) from what Darwin lacked (particulate inheritance mechanism)."
            },
            {
              "chapter": "Connect Darwinism to major lines of evidence: homology, biogeography, fossils, and artificial selection."
            },
            {
              "chapter": "Solve typical GATE-style conceptual MCQs on variation, selection, fitness, and adaptation."
            }
          ]
        },
        {
          "lesson": "Modern Synthesis: Genetics Meets Natural Selection",
          "lesson_key": "modern_synthesis_genetics_meets_natural_selection",
          "chapters": [
            {
              "chapter": "Define the Modern Synthesis and identify what new components it added to Darwinism."
            },
            {
              "chapter": "Use Hardy–Weinberg equilibrium as a null model and list evolutionary forces that violate it."
            },
            {
              "chapter": "Explain how mutation, recombination, selection, drift, and gene flow change allele frequencies."
            },
            {
              "chapter": "Connect microevolutionary processes to speciation and macroevolutionary patterns at an overview level."
            }
          ]
        },
        {
          "lesson": "High-Yield Comparison and Exam Readiness (Lamarckism vs Darwinism vs Modern Synthesis)",
          "lesson_key": "high_yield_comparison_and_exam_readiness_lamarckism_vs_darwinism_vs_modern_synthesis",
          "chapters": [
            {
              "chapter": "Compare Lamarckism, Darwinism, and the Modern Synthesis across variation source, inheritance model, and mechanism of change."
            },
            {
              "chapter": "Classify statements into the correct theory (common GATE assertion–reason patterns)."
            },
            {
              "chapter": "Disambiguate teleological phrasing and reframe it in mechanistic evolutionary language."
            },
            {
              "chapter": "Practice constructing short, precise explanations suitable for 1–2 mark questions."
            }
          ]
        }
      ]
    },
    {
      "topic": "Fundamentals",
      "topic_key": "fundamentals",
      "lessons": [
        {
          "lesson": "Variation: What Varies and Why It Matters",
          "lesson_key": "variation_what_varies_and_why_it_matters",
          "chapters": [
            {
              "chapter": "Distinguish genetic variation from phenotypic variation and explain how environment contributes to phenotype."
            },
            {
              "chapter": "Classify variation as continuous vs discrete and relate each to polygenic vs single-gene architectures."
            },
            {
              "chapter": "Identify sources of variation: mutation, recombination, and standing genetic variation."
            },
            {
              "chapter": "Explain why selection requires pre-existing heritable variation to cause evolutionary change."
            }
          ]
        },
        {
          "lesson": "Heritability: Quantifying Genetic Contribution",
          "lesson_key": "heritability_quantifying_genetic_contribution",
          "chapters": [
            {
              "chapter": "Define phenotypic variance and decompose it into genetic and environmental components at a conceptual level."
            },
            {
              "chapter": "Differentiate broad-sense heritability \\(H^2\\) from narrow-sense heritability \\(h^2\\)."
            },
            {
              "chapter": "Interpret what heritability does and does not imply (population- and environment-specific)."
            },
            {
              "chapter": "Predict qualitative response to selection when heritability is high vs low."
            }
          ]
        },
        {
          "lesson": "Natural Selection: Mechanism and Logic",
          "lesson_key": "natural_selection_mechanism_and_logic",
          "chapters": [
            {
              "chapter": "State the conditions for natural selection: variation, heritability, and differential fitness."
            },
            {
              "chapter": "Explain the distinction: selection acts on phenotypes but evolution is change in allele frequencies."
            },
            {
              "chapter": "Describe how selection can be directional, stabilizing, or disruptive depending on fitness–phenotype relationships."
            },
            {
              "chapter": "Translate verbal scenarios into selection outcomes (which phenotype/genotype increases)."
            }
          ]
        },
        {
          "lesson": "Fitness and Adaptation: Meaning, Measurement, and Misconceptions",
          "lesson_key": "fitness_and_adaptation_meaning_measurement_and_misconceptions",
          "chapters": [
            {
              "chapter": "Define absolute and relative fitness and list major fitness components."
            },
            {
              "chapter": "Differentiate adaptation (trait/process) from acclimation and from mere utility."
            },
            {
              "chapter": "Explain context dependence: why a trait can be adaptive in one environment and maladaptive in another."
            },
            {
              "chapter": "Recognize trade-offs and constraints shaping adaptations."
            }
          ]
        },
        {
          "lesson": "Types of Selection: Stabilizing, Directional, and Disruptive",
          "lesson_key": "types_of_selection_stabilizing_directional_and_disruptive",
          "chapters": [
            {
              "chapter": "Define stabilizing, directional, and disruptive selection using fitness–phenotype relationships."
            },
            {
              "chapter": "Predict effects on trait mean and variance for each selection type."
            },
            {
              "chapter": "Connect selection types to real biological examples and to maintenance of polymorphism."
            },
            {
              "chapter": "Answer GATE-style questions involving histograms and qualitative trait distributions."
            }
          ]
        }
      ]
    },
    {
      "topic": "Diversity of Life",
      "topic_key": "diversity_of_life",
      "lessons": [
        {
          "lesson": "Origin of Life: From Prebiotic Chemistry to First Cells (Conceptual)",
          "lesson_key": "origin_of_life_from_prebiotic_chemistry_to_first_cells_conceptual",
          "chapters": [
            {
              "chapter": "Outline the key steps any origin-of-life model must explain: compartmentalization, metabolism/energy, and heredity/replication."
            },
            {
              "chapter": "Describe major hypotheses (RNA world, metabolism-first, lipid world) and what evidence supports each."
            },
            {
              "chapter": "Explain why abiogenesis is studied through chemistry, geology, and comparative biology rather than direct observation."
            },
            {
              "chapter": "Recognize exam-style statements that confuse origin of life with evolution by natural selection."
            }
          ]
        },
        {
          "lesson": "History of Life on Earth: Major Milestones and Evidence",
          "lesson_key": "history_of_life_on_earth_major_milestones_and_evidence",
          "chapters": [
            {
              "chapter": "Place major evolutionary events in correct chronological order using the geological time framework."
            },
            {
              "chapter": "Explain key transitions: prokaryotes to eukaryotes, oxygenic photosynthesis, multicellularity, and major radiations."
            },
            {
              "chapter": "Describe how fossil and molecular data jointly inform deep evolutionary history."
            },
            {
              "chapter": "Identify common misconceptions (progress narratives, humans as 'goal', linear ladders)."
            }
          ]
        },
        {
          "lesson": "Diversity of Life: What It Means and How It Is Described",
          "lesson_key": "diversity_of_life_what_it_means_and_how_it_is_described",
          "chapters": [
            {
              "chapter": "Define taxonomic, phylogenetic, and functional diversity and explain why evolutionary biologists care about each."
            },
            {
              "chapter": "Relate diversification to speciation and extinction conceptually (without heavy macroevolution math)."
            },
            {
              "chapter": "Interpret broad patterns of diversity across the tree of life (prokaryotes vs eukaryotes; cryptic diversity)."
            },
            {
              "chapter": "Connect diversity descriptions to classification goals (communication, prediction, evolutionary explanation)."
            }
          ]
        },
        {
          "lesson": "Principles of Classification: Taxonomy and Characters",
          "lesson_key": "principles_of_classification_taxonomy_and_characters",
          "chapters": [
            {
              "chapter": "Explain why characters (morphological or molecular) must be evaluated for homology before classification."
            },
            {
              "chapter": "Differentiate homology from analogy with examples relevant to classification."
            },
            {
              "chapter": "Describe character states and how ancestral vs derived states are inferred using outgroups."
            },
            {
              "chapter": "Identify sources of error: convergence, reversals, and character correlation."
            }
          ]
        },
        {
          "lesson": "Cladistics: Classification by Common Ancestry",
          "lesson_key": "cladistics_classification_by_common_ancestry",
          "chapters": [
            {
              "chapter": "Define clades and identify synapomorphies as evidence for monophyly."
            },
            {
              "chapter": "Distinguish monophyletic, paraphyletic, and polyphyletic groups with examples."
            },
            {
              "chapter": "Read a cladogram correctly: nodes, sister groups, rooting, and what tip order does/does not mean."
            },
            {
              "chapter": "Explain (conceptually) how cladograms are inferred from character data (parsimony/likelihood as ideas)."
            }
          ]
        },
        {
          "lesson": "Phenetics: Numerical Taxonomy and Overall Similarity",
          "lesson_key": "phenetics_numerical_taxonomy_and_overall_similarity",
          "chapters": [
            {
              "chapter": "Define phenetics and explain its central idea: grouping by overall similarity."
            },
            {
              "chapter": "Describe, at an overview level, how distance matrices and clustering generate phenograms."
            },
            {
              "chapter": "Contrast phenograms with cladograms and explain why similarity need not reflect shared ancestry."
            },
            {
              "chapter": "Identify scenarios where phenetics can be useful (identification) and where it fails (convergence)."
            }
          ]
        },
        {
          "lesson": "Integrating Systems: Cladistics vs Phenetics for GATE-Style Questions",
          "lesson_key": "integrating_systems_cladistics_vs_phenetics_for_gate_style_questions",
          "chapters": [
            {
              "chapter": "Perform point-by-point comparisons of cladistics and phenetics (data, assumptions, outputs, interpretation)."
            },
            {
              "chapter": "Classify exam statements as describing cladistics or phenetics."
            },
            {
              "chapter": "Resolve conflicts between similarity and ancestry using homology/homoplasy reasoning."
            },
            {
              "chapter": "Interpret simple toy datasets (few taxa, few characters) to infer likely groupings under each approach."
            }
          ]
        }
      ]
    },
    {
      "topic": "Life History Strategies",
      "topic_key": "life_history_strategies",
      "lessons": [
        {
          "lesson": "Life-History Theory: What Strategies Are and Why They Evolve",
          "lesson_key": "life_history_theory_what_strategies_are_and_why_they_evolve",
          "chapters": [
            {
              "chapter": "Define life-history traits and explain why they form integrated strategies rather than independent traits."
            },
            {
              "chapter": "Explain the role of constraints (energy, time, physiology) in shaping life-history evolution."
            },
            {
              "chapter": "Describe how natural selection optimizes lifetime reproductive success in a given environment (conceptual)."
            },
            {
              "chapter": "Identify typical GATE confusions: adaptation vs optimality, individual intention vs evolved strategy."
            }
          ]
        },
        {
          "lesson": "Allocation of Resources: Energy Budgets and Competing Demands",
          "lesson_key": "allocation_of_resources_energy_budgets_and_competing_demands",
          "chapters": [
            {
              "chapter": "Explain the allocation principle: limited resources require partitioning among maintenance, growth, and reproduction."
            },
            {
              "chapter": "Relate allocation decisions to observable life-history traits (age/size at maturity, fecundity, survival)."
            },
            {
              "chapter": "Differentiate allocation trade-offs from mere correlations by using causal reasoning."
            },
            {
              "chapter": "Recognize plastic allocation (condition dependence) vs genetically fixed strategies."
            }
          ]
        },
        {
          "lesson": "Trade-offs: The Engine of Life-History Evolution",
          "lesson_key": "trade_offs_the_engine_of_life_history_evolution",
          "chapters": [
            {
              "chapter": "Define trade-offs and explain why they occur (limited resources, antagonistic pleiotropy, physiological constraints)."
            },
            {
              "chapter": "Describe classic life-history trade-offs: offspring size vs number; reproduction vs survival; growth vs reproduction."
            },
            {
              "chapter": "Explain the 'cost of reproduction' and how it is detected empirically (conceptual)."
            },
            {
              "chapter": "Use trade-off reasoning to answer scenario-based GATE questions."
            }
          ]
        },
        {
          "lesson": "r/K Selection: Predictions, Uses, and Limitations",
          "lesson_key": "r_k_selection_predictions_uses_and_limitations",
          "chapters": [
            {
              "chapter": "Define \\(r\\) and \\(K\\) and connect them to population growth and density dependence at a conceptual level."
            },
            {
              "chapter": "List classic r-selected vs K-selected trait syndromes and the ecological contexts that favor them."
            },
            {
              "chapter": "Explain why r/K selection is a heuristic and where it breaks down."
            },
            {
              "chapter": "Translate exam statements about disturbance, competition, and density dependence into r/K predictions."
            }
          ]
        },
        {
          "lesson": "Semelparity and Iteroparity: Single vs Repeated Reproduction",
          "lesson_key": "semelparity_and_iteroparity_single_vs_repeated_reproduction",
          "chapters": [
            {
              "chapter": "Define semelparity and iteroparity with canonical examples."
            },
            {
              "chapter": "Explain ecological conditions favoring semelparity vs iteroparity using survival, seasonality, and uncertainty."
            },
            {
              "chapter": "Connect parity mode to allocation and trade-offs (current vs future reproduction)."
            },
            {
              "chapter": "Predict how changes in adult survival or environmental unpredictability shift the favored parity strategy."
            }
          ]
        },
        {
          "lesson": "Integration Practice: Life-History Strategy Reasoning for GATE",
          "lesson_key": "integration_practice_life_history_strategy_reasoning_for_gate",
          "chapters": [
            {
              "chapter": "Synthesize allocation, trade-offs, r/K context, and parity modes into coherent explanations."
            },
            {
              "chapter": "Answer multi-statement MCQs by identifying which life-history predictions follow from given ecology."
            },
            {
              "chapter": "Distinguish density-dependent selection (competition) from stochastic mortality (disturbance) in life-history outcomes."
            },
            {
              "chapter": "Write short, mechanism-first justifications (2–4 lines) for typical exam questions."
            }
          ]
        }
      ]
    },
    {
      "topic": "Interactions",
      "topic_key": "interactions",
      "lessons": [
        {
          "lesson": "Coevolution: Definition, Criteria, and Common Misconceptions",
          "lesson_key": "coevolution_definition_criteria_and_common_misconceptions",
          "chapters": [
            {
              "chapter": "Define coevolution as reciprocal evolutionary change and distinguish it from one-sided adaptation."
            },
            {
              "chapter": "List the evidence needed to infer coevolution (reciprocal selection, trait matching, and response over time)."
            },
            {
              "chapter": "Differentiate pairwise coevolution from diffuse coevolution in communities."
            },
            {
              "chapter": "Identify common exam traps: co-occurrence vs coevolution, correlation vs causation."
            }
          ]
        },
        {
          "lesson": "Co-adaptations and Arms Races: How Reciprocal Selection Escalates",
          "lesson_key": "co_adaptations_and_arms_races_how_reciprocal_selection_escalates",
          "chapters": [
            {
              "chapter": "Explain how arms races arise from reciprocal selection in antagonistic interactions."
            },
            {
              "chapter": "Describe typical arms-race trait categories: detection vs concealment, toxins vs detoxification, speed vs maneuverability."
            },
            {
              "chapter": "Connect arms races to rapid evolution, strong selection, and trait escalation limits."
            },
            {
              "chapter": "Explain why arms races can stop or cycle due to costs, constraints, and trade-offs."
            }
          ]
        },
        {
          "lesson": "Red Queen Hypothesis: Continuous Evolution in a Biotic World",
          "lesson_key": "red_queen_hypothesis_continuous_evolution_in_a_biotic_world",
          "chapters": [
            {
              "chapter": "State the Red Queen hypothesis and the problem it addresses (maintaining relative fitness against evolving antagonists)."
            },
            {
              "chapter": "Explain how negative frequency-dependent selection can maintain genetic diversity under Red Queen dynamics."
            },
            {
              "chapter": "Apply Red Queen reasoning to host–parasite and predator–prey examples."
            },
            {
              "chapter": "Differentiate Red Queen effects from abiotic environmental change and from directional selection in a static environment."
            }
          ]
        },
        {
          "lesson": "Cospeciation: Parallel Diversification of Interacting Lineages",
          "lesson_key": "cospeciation_parallel_diversification_of_interacting_lineages",
          "chapters": [
            {
              "chapter": "Define cospeciation and identify when it is expected (tight, persistent associations)."
            },
            {
              "chapter": "Interpret basic host–associate phylogeny congruence and what it implies."
            },
            {
              "chapter": "Distinguish cospeciation from alternative processes: host switching, duplication, sorting/extinction."
            },
            {
              "chapter": "Answer GATE-style assertion–reason questions about cospeciation evidence."
            }
          ]
        },
        {
          "lesson": "Predator–Prey Evolution: Defensive and Offensive Adaptations",
          "lesson_key": "predator_prey_evolution_defensive_and_offensive_adaptations",
          "chapters": [
            {
              "chapter": "Explain predation as a selective force shaping prey defenses and predator counter-adaptations."
            },
            {
              "chapter": "Classify defenses into pre-encounter (avoid detection) and post-encounter (avoid capture/consumption)."
            },
            {
              "chapter": "Connect predator sensory biology to which defenses are favored."
            },
            {
              "chapter": "Apply evolutionary reasoning to case studies (camouflage, mimicry, toxins, behavior)."
            }
          ]
        },
        {
          "lesson": "Mimicry Systems: Batesian, Müllerian, and Aggressive Mimicry",
          "lesson_key": "mimicry_systems_batesian_müllerian_and_aggressive_mimicry",
          "chapters": [
            {
              "chapter": "Define mimicry and distinguish Batesian, Müllerian, and aggressive mimicry."
            },
            {
              "chapter": "Explain frequency dependence in Batesian mimicry and why model abundance matters."
            },
            {
              "chapter": "Explain how Müllerian mimicry can reinforce warning signals and reduce predator learning costs."
            },
            {
              "chapter": "Solve graph/statement questions linking mimic frequency to fitness outcomes."
            }
          ]
        },
        {
          "lesson": "Integration and GATE Readiness: Coevolution + Predator–Prey",
          "lesson_key": "integration_and_gate_readiness_coevolution_predator_prey",
          "chapters": [
            {
              "chapter": "Integrate coevolution concepts with predator–prey defenses into a single causal explanation."
            },
            {
              "chapter": "Decide whether an example reflects arms race, Red Queen cycling, or simple directional selection."
            },
            {
              "chapter": "Use correct evolutionary language (fitness, selection, frequency dependence) in short answers."
            },
            {
              "chapter": "Handle assertion–reason and match-the-following questions on mimicry, crypsis, cospeciation."
            }
          ]
        }
      ]
    },
    {
      "topic": "Population and Quantitative Genetics",
      "topic_key": "population_and_quantitative_genetics",
      "lessons": [
        {
          "lesson": "Genetic Variation: Sources and How Populations Store It",
          "lesson_key": "genetic_variation_sources_and_how_populations_store_it",
          "chapters": [
            {
              "chapter": "List the ultimate and proximate sources of genetic variation: mutation, recombination, and gene flow."
            },
            {
              "chapter": "Distinguish new mutation from standing variation and explain why the latter often fuels rapid evolution."
            },
            {
              "chapter": "Explain how segregation and recombination generate new genotype combinations without creating new alleles."
            },
            {
              "chapter": "Connect variation to evolutionary potential: why low variation can limit adaptation."
            }
          ]
        },
        {
          "lesson": "Mendelian Genetics Refresher for Population Genetics",
          "lesson_key": "mendelian_genetics_refresher_for_population_genetics",
          "chapters": [
            {
              "chapter": "Translate Mendelian segregation into genotype-frequency expectations under random mating."
            },
            {
              "chapter": "Relate dominance/recessiveness to phenotype frequencies and to selection visibility."
            },
            {
              "chapter": "Compute allele frequencies from genotype counts (conceptual fluency for exam numericals)."
            },
            {
              "chapter": "Recognize how non-Mendelian genotype–phenotype maps (e.g., incomplete dominance) alter interpretation, not inheritance."
            }
          ]
        },
        {
          "lesson": "Hardy–Weinberg Equilibrium: The Null Model",
          "lesson_key": "hardy_weinberg_equilibrium_the_null_model",
          "chapters": [
            {
              "chapter": "State HWE assumptions and interpret HWE as a baseline, not a claim that evolution stops."
            },
            {
              "chapter": "Derive genotype frequencies from allele frequencies under random mating."
            },
            {
              "chapter": "Use HWE deviations to infer which assumptions might be violated (selection, drift, migration, nonrandom mating)."
            },
            {
              "chapter": "Solve common GATE numericals involving HWE and carrier frequencies."
            }
          ]
        },
        {
          "lesson": "Genetic Drift: Random Evolution in Finite Populations",
          "lesson_key": "genetic_drift_random_evolution_in_finite_populations",
          "chapters": [
            {
              "chapter": "Explain drift as sampling error and predict when it dominates over selection."
            },
            {
              "chapter": "Describe drift outcomes: fixation/loss, reduced heterozygosity, increased divergence among populations."
            },
            {
              "chapter": "Differentiate census size from effective size \\(N_e\\) and state factors that reduce \\(N_e\\)."
            },
            {
              "chapter": "Apply drift reasoning to bottleneck and founder-effect scenarios."
            }
          ]
        },
        {
          "lesson": "Selection: One-Locus Two-Allele Model (Deterministic)",
          "lesson_key": "selection_one_locus_two_allele_model_deterministic",
          "chapters": [
            {
              "chapter": "Set up genotype fitnesses for \\(AA\\), \\(Aa\\), \\(aa\\) and interpret relative fitness."
            },
            {
              "chapter": "Predict allele-frequency change direction given fitness ordering."
            },
            {
              "chapter": "Explain how dominance affects the speed of allele-frequency change and maintenance of alleles."
            },
            {
              "chapter": "Recognize special cases: heterozygote advantage and disadvantage (conceptual)."
            }
          ]
        },
        {
          "lesson": "Population Structure: Panmixia, Gene Flow, and \\(F_{ST}\\)",
          "lesson_key": "population_structure_panmixia_gene_flow_and_f__st",
          "chapters": [
            {
              "chapter": "Define panmixia and explain how population subdivision violates it."
            },
            {
              "chapter": "Explain gene flow’s homogenizing effect and how it interacts with drift and local selection."
            },
            {
              "chapter": "Define \\(F_{ST}\\) as a measure of differentiation and interpret low vs high values."
            },
            {
              "chapter": "Relate \\(F_{ST}\\) patterns to biological scenarios (high migration, isolation, recent divergence)."
            }
          ]
        },
        {
          "lesson": "Quantitative Genetics: Polygenic Traits and Response to Selection",
          "lesson_key": "quantitative_genetics_polygenic_traits_and_response_to_selection",
          "chapters": [
            {
              "chapter": "Explain why polygenic traits are typically continuous and environment-sensitive."
            },
            {
              "chapter": "Define variance components \\(V_P\\), \\(V_G\\), \\(V_E\\) and the additive component \\(V_A\\)."
            },
            {
              "chapter": "Differentiate broad-sense \\(H^2\\) and narrow-sense \\(h^2\\) heritability and interpret each."
            },
            {
              "chapter": "Use the breeder’s equation \\(R = h^2 S\\) to predict response direction and relative magnitude."
            }
          ]
        },
        {
          "lesson": "Gene–Environment Interaction and Phenotypic Plasticity",
          "lesson_key": "gene_environment_interaction_and_phenotypic_plasticity",
          "chapters": [
            {
              "chapter": "Define phenotypic plasticity and represent it using reaction norms."
            },
            {
              "chapter": "Define G×E interaction and explain how it differs from simple environmental effects."
            },
            {
              "chapter": "Explain how plasticity can aid short-term persistence and influence long-term evolutionary trajectories."
            },
            {
              "chapter": "Identify experimental designs (common garden, reciprocal transplant) that separate genetic and environmental components."
            }
          ]
        }
      ]
    },
    {
      "topic": "Molecular Evolution and Phylogenetics",
      "topic_key": "molecular_evolution_and_phylogenetics",
      "lessons": [
        {
          "lesson": "Neutral and Nearly Neutral Theory: Drift as the Driver of Molecular Change",
          "lesson_key": "neutral_and_nearly_neutral_theory_drift_as_the_driver_of_molecular_change",
          "chapters": [
            {
              "chapter": "State the neutral theory and explain how it differs from adaptation-focused views of evolution."
            },
            {
              "chapter": "Distinguish mutation rate from substitution rate and connect substitution to fixation under drift."
            },
            {
              "chapter": "Explain why \\(N_e\\) matters for the fate of weakly selected mutations (nearly neutral theory)."
            },
            {
              "chapter": "Predict qualitative patterns expected under neutrality (polymorphism, substitutions, and rate constancy)."
            }
          ]
        },
        {
          "lesson": "Rates of Molecular Evolution: What Changes Fast and Why",
          "lesson_key": "rates_of_molecular_evolution_what_changes_fast_and_why",
          "chapters": [
            {
              "chapter": "List major determinants of substitution rate variation across genes and lineages."
            },
            {
              "chapter": "Explain why functional constraint leads to slower evolution and why synonymous sites often evolve faster than nonsynonymous sites."
            },
            {
              "chapter": "Interpret the idea behind \\(d_N/d_S\\) as a conceptual test of selection in coding regions."
            },
            {
              "chapter": "Recognize common exam pitfalls: confusing polymorphism with substitution; confusing mutation rate with substitution rate."
            }
          ]
        },
        {
          "lesson": "Molecular Clocks: Dating Divergences with Calibrations",
          "lesson_key": "molecular_clocks_dating_divergences_with_calibrations",
          "chapters": [
            {
              "chapter": "Define a molecular clock and differentiate strict clocks from relaxed clocks (conceptual)."
            },
            {
              "chapter": "Explain how calibration (fossils/biogeography) anchors molecular time estimates."
            },
            {
              "chapter": "List reasons molecular clocks deviate from constancy (rate heterogeneity, selection, generation time, saturation)."
            },
            {
              "chapter": "Solve simple clock-style numericals (distance \\(\\rightarrow\\) time) conceptually."
            }
          ]
        },
        {
          "lesson": "Foundations of Phylogenetic Reconstruction (Tree Thinking + Data)",
          "lesson_key": "foundations_of_phylogenetic_reconstruction_tree_thinking_data",
          "chapters": [
            {
              "chapter": "Identify the parts of a phylogenetic tree (nodes, branches, clades) and interpret what they mean."
            },
            {
              "chapter": "Explain rooting with outgroups and why rooting matters for evolutionary interpretation."
            },
            {
              "chapter": "Describe why sequence alignment is a statement of homology and how poor alignment misleads inference."
            },
            {
              "chapter": "Recognize key sources of phylogenetic error: homoplasy, long-branch attraction, and model misspecification."
            }
          ]
        },
        {
          "lesson": "Reconstruction Methods: Distance, Parsimony, Likelihood, Bayesian (Exam-Focused)",
          "lesson_key": "reconstruction_methods_distance_parsimony_likelihood_bayesian_exam_focused",
          "chapters": [
            {
              "chapter": "Compare distance-based methods, parsimony, maximum likelihood, and Bayesian inference in terms of assumptions and outputs."
            },
            {
              "chapter": "Explain when UPGMA is appropriate (ultrametric clock-like data) and when neighbor-joining is used."
            },
            {
              "chapter": "Describe why model-based methods (ML/Bayesian) can outperform parsimony under rate heterogeneity."
            },
            {
              "chapter": "Interpret support values: bootstrap vs posterior probability."
            }
          ]
        },
        {
          "lesson": "Molecular Systematics: Using Molecules to Classify and Test Evolutionary Hypotheses",
          "lesson_key": "molecular_systematics_using_molecules_to_classify_and_test_evolutionary_hypotheses",
          "chapters": [
            {
              "chapter": "Explain how molecular systematics tests monophyly and revises classification."
            },
            {
              "chapter": "Distinguish gene tree inference from species tree inference and list causes of discordance."
            },
            {
              "chapter": "Describe how DNA barcoding and multilocus approaches support species delimitation (overview)."
            },
            {
              "chapter": "Apply molecular phylogenies to biogeography and trait evolution questions at a conceptual level."
            }
          ]
        }
      ]
    },
    {
      "topic": "Macroevolution",
      "topic_key": "macroevolution",
      "lessons": [
        {
          "lesson": "Macroevolution: Connecting Microevolution to Large-Scale Patterns",
          "lesson_key": "macroevolution_connecting_microevolution_to_large_scale_patterns",
          "chapters": [
            {
              "chapter": "Define macroevolution and distinguish it from microevolution by scale and focal processes."
            },
            {
              "chapter": "Explain how speciation and extinction generate macroevolutionary patterns in diversity."
            },
            {
              "chapter": "Recognize that macroevolution does not require 'new mechanisms' beyond mutation, selection, drift, and gene flow, but emphasizes their long-term outcomes."
            },
            {
              "chapter": "Interpret common macroevolution terms used in exams (radiation, convergence, vicariance)."
            }
          ]
        },
        {
          "lesson": "Species Concepts: Defining Species in Theory and Practice",
          "lesson_key": "species_concepts_defining_species_in_theory_and_practice",
          "chapters": [
            {
              "chapter": "Define biological, morphological, phylogenetic, and ecological species concepts."
            },
            {
              "chapter": "State strengths and limitations of each concept (especially in asexuals, fossils, and cryptic species)."
            },
            {
              "chapter": "Predict which species concept is most appropriate for a given dataset (morphology, gene sequences, breeding tests)."
            },
            {
              "chapter": "Avoid common pitfalls: equating species with 'looks different' or assuming one universal concept."
            }
          ]
        },
        {
          "lesson": "Speciation: Mechanisms and Modes",
          "lesson_key": "speciation_mechanisms_and_modes",
          "chapters": [
            {
              "chapter": "Define speciation as the evolution of reproductive isolation and explain why reduced gene flow is central."
            },
            {
              "chapter": "Distinguish prezygotic from postzygotic barriers with examples."
            },
            {
              "chapter": "Compare allopatric, peripatric, parapatric, and sympatric speciation and identify conditions favoring each."
            },
            {
              "chapter": "Explain key genetic ideas underlying postzygotic isolation (DMI) at a conceptual level."
            }
          ]
        },
        {
          "lesson": "Adaptive Radiation: Rapid Diversification and Ecological Opportunity",
          "lesson_key": "adaptive_radiation_rapid_diversification_and_ecological_opportunity",
          "chapters": [
            {
              "chapter": "Define adaptive radiation and state its key signatures: rapid speciation plus ecological/phenotypic divergence."
            },
            {
              "chapter": "Explain drivers: ecological opportunity, release from competitors/predators, and key innovations."
            },
            {
              "chapter": "Differentiate adaptive radiation from non-adaptive radiation (many species with limited ecological divergence)."
            },
            {
              "chapter": "Apply radiation logic to classic examples (islands, lakes) in exam-style questions."
            }
          ]
        },
        {
          "lesson": "Convergence: Similar Problems, Similar Solutions",
          "lesson_key": "convergence_similar_problems_similar_solutions",
          "chapters": [
            {
              "chapter": "Define convergent evolution and distinguish it from parallel evolution and shared ancestry."
            },
            {
              "chapter": "Explain how similar selective pressures can yield similar phenotypes in unrelated lineages."
            },
            {
              "chapter": "Describe how convergence creates homoplasy and can mislead classification and phylogenetic inference."
            },
            {
              "chapter": "Interpret convergence examples using function-first reasoning."
            }
          ]
        },
        {
          "lesson": "Biogeography: Distributions as Evidence for Evolution",
          "lesson_key": "biogeography_distributions_as_evidence_for_evolution",
          "chapters": [
            {
              "chapter": "Define biogeography and explain how distributions reflect evolutionary history."
            },
            {
              "chapter": "Distinguish vicariance from dispersal as explanations for disjunct ranges."
            },
            {
              "chapter": "Connect geography to speciation: how isolation, colonization, and barriers promote diversification."
            },
            {
              "chapter": "Use phylogenies plus geography to infer plausible historical scenarios (conceptual)."
            }
          ]
        }
      ]
    },
    {
      "topic": "Mathematics and Statistics in Ecology",
      "topic_key": "mathematics_and_statistics_in_ecology",
      "lessons": [
        {
          "lesson": "Simple functions for ecological patterns",
          "lesson_key": "simple_functions_for_ecological_patterns",
          "chapters": [
            {
              "chapter": "Identify linear, quadratic, exponential, and logarithmic functions from equations, tables, and plots."
            },
            {
              "chapter": "Sketch key features of each function (intercepts, curvature, asymptotes) and interpret parameters."
            },
            {
              "chapter": "Choose plausible functional forms for common ecological relationships (growth, decay, scaling)."
            },
            {
              "chapter": "Compute function values and solve for inputs using algebraic rearrangement (including logs and exponentials)."
            }
          ]
        },
        {
          "lesson": "Derivatives and slope as ecological rate of change",
          "lesson_key": "derivatives_and_slope_as_ecological_rate_of_change",
          "chapters": [
            {
              "chapter": "Explain slope as average vs instantaneous rate of change."
            },
            {
              "chapter": "Compute derivatives of polynomials, exponentials, and logarithms."
            },
            {
              "chapter": "Interpret derivatives in ecological contexts (marginal change, sensitivity, elasticities qualitatively)."
            },
            {
              "chapter": "Use derivatives to identify increasing/decreasing behavior and maxima/minima for simple functions."
            }
          ]
        },
        {
          "lesson": "Counting methods: permutations and combinations",
          "lesson_key": "counting_methods_permutations_and_combinations",
          "chapters": [
            {
              "chapter": "Differentiate permutations (order matters) from combinations (order does not)."
            },
            {
              "chapter": "Compute \\(n!\\), \\(P(n,r)\\), and \\(C(n,r)\\) for typical exam-scale values."
            },
            {
              "chapter": "Translate word problems (sampling, draws, assignments) into counting expressions."
            },
            {
              "chapter": "Connect counting results to probability calculations."
            }
          ]
        },
        {
          "lesson": "Basic probability for random events and sequences",
          "lesson_key": "basic_probability_for_random_events_and_sequences",
          "chapters": [
            {
              "chapter": "Define sample space, events, and probabilities for discrete scenarios."
            },
            {
              "chapter": "Apply addition and multiplication rules correctly."
            },
            {
              "chapter": "Compute probabilities for sequences of events (with/without replacement)."
            },
            {
              "chapter": "Use conditional probability to test independence."
            }
          ]
        },
        {
          "lesson": "Frequency distributions and descriptive statistics",
          "lesson_key": "frequency_distributions_and_descriptive_statistics",
          "chapters": [
            {
              "chapter": "Construct frequency tables and interpret histogram-like summaries."
            },
            {
              "chapter": "Compute mean, variance, and standard deviation for ungrouped and simple grouped data."
            },
            {
              "chapter": "Compute and interpret coefficient of variation for comparing variability across scales."
            },
            {
              "chapter": "Compute covariance and correlation and interpret direction/strength of association."
            },
            {
              "chapter": "Diagnose when summaries can mislead (outliers, skewness, nonlinearity) at an exam-appropriate level."
            }
          ]
        }
      ]
    },
    {
      "topic": "Statistical Hypothesis Testing",
      "topic_key": "statistical_hypothesis_testing",
      "lessons": [
        {
          "lesson": "Foundations of hypothesis testing and p-values",
          "lesson_key": "foundations_of_hypothesis_testing_and_p_values",
          "chapters": [
            {
              "chapter": "State null and alternative hypotheses for ecological questions."
            },
            {
              "chapter": "Explain a p-value as \\(P(\\text{data as or more extreme}\\mid H_0)\\) and avoid common misinterpretations."
            },
            {
              "chapter": "Relate p-values to the decision rule using significance level \\(\\alpha\\)."
            },
            {
              "chapter": "Recognize how sample size and variability affect statistical significance."
            }
          ]
        },
        {
          "lesson": "Type I/II errors and statistical power",
          "lesson_key": "type_i_ii_errors_and_statistical_power",
          "chapters": [
            {
              "chapter": "Define Type I error and Type II error in plain language and in terms of \\(H_0\\) decisions."
            },
            {
              "chapter": "Relate \\(\\alpha\\) to Type I error probability and \\(\\beta\\) to Type II error probability."
            },
            {
              "chapter": "Define power \\(1-\\beta\\) and describe factors that increase power (effect size, \\(n\\), noise, \\(\\alpha\\))."
            },
            {
              "chapter": "Reason about trade-offs in ecological monitoring and management decisions."
            }
          ]
        },
        {
          "lesson": "t-tests: comparing means",
          "lesson_key": "t_tests_comparing_means",
          "chapters": [
            {
              "chapter": "Choose among one-sample, paired, and independent two-sample t-tests for a given study design."
            },
            {
              "chapter": "State assumptions (independence, approximate normality, equal variances where relevant)."
            },
            {
              "chapter": "Compute/interpret the t-statistic conceptually as standardized mean difference."
            },
            {
              "chapter": "Read typical outputs: \\(t\\), degrees of freedom, p-value, and confidence interval."
            }
          ]
        },
        {
          "lesson": "Chi-square tests: counts and contingency tables",
          "lesson_key": "chi_square_tests_counts_and_contingency_tables",
          "chapters": [
            {
              "chapter": "Decide whether a chi-square goodness-of-fit or independence test is appropriate."
            },
            {
              "chapter": "Compute expected counts and degrees of freedom for simple tables."
            },
            {
              "chapter": "Interpret the chi-square statistic as an aggregated discrepancy between observed and expected."
            },
            {
              "chapter": "Recognize conditions for validity (notably small expected counts)."
            }
          ]
        },
        {
          "lesson": "Basics of linear regression",
          "lesson_key": "basics_of_linear_regression",
          "chapters": [
            {
              "chapter": "Write the simple linear regression model and interpret slope and intercept."
            },
            {
              "chapter": "Explain least squares as minimizing the sum of squared residuals."
            },
            {
              "chapter": "Interpret residuals, fitted values, and \\(R^2\\) at a working level."
            },
            {
              "chapter": "Test whether the slope differs from zero and connect this to correlation."
            },
            {
              "chapter": "Recognize key assumptions (linearity, independence, constant variance, approximately normal residuals)."
            }
          ]
        },
        {
          "lesson": "Basics of ANOVA and its link to regression",
          "lesson_key": "basics_of_anova_and_its_link_to_regression",
          "chapters": [
            {
              "chapter": "Explain one-way ANOVA as comparing multiple group means using variance partitioning."
            },
            {
              "chapter": "Define between-group and within-group variability and their roles in the F-statistic."
            },
            {
              "chapter": "State ANOVA assumptions and what violations imply at a high level."
            },
            {
              "chapter": "Recognize ANOVA as a special case of linear models (regression with categorical predictors)."
            }
          ]
        }
      ]
    },
    {
      "topic": "Classical Ethology",
      "topic_key": "classical_ethology",
      "lessons": [
        {
          "lesson": "Foundations of Classical Ethology",
          "lesson_key": "foundations_of_classical_ethology",
          "chapters": [
            {
              "chapter": "Define classical ethology and distinguish it from broader behavioral ecology."
            },
            {
              "chapter": "Explain why ethologists emphasized naturalistic observation and species-typical behavior."
            },
            {
              "chapter": "Use an ethogram-style description to separate observation from inference."
            }
          ]
        },
        {
          "lesson": "Instinct and Innate Behavioral Programs",
          "lesson_key": "instinct_and_innate_behavioral_programs",
          "chapters": [
            {
              "chapter": "Define instinct and list key properties of innate behaviors (species-typicality, developmental robustness, triggers)."
            },
            {
              "chapter": "Differentiate innate behavior from learned behavior and from reflexes."
            },
            {
              "chapter": "Explain how genes, development, and environment jointly shape innate behavior (reaction norms)."
            }
          ]
        },
        {
          "lesson": "Fixed Action Patterns, Sign Stimuli, and Releasing Mechanisms",
          "lesson_key": "fixed_action_patterns_sign_stimuli_and_releasing_mechanisms",
          "chapters": [
            {
              "chapter": "Define fixed action patterns (FAPs) and identify their diagnostic features (stereotypy, sequence completion)."
            },
            {
              "chapter": "Explain how sign stimuli trigger FAPs and how supernormal stimuli can exaggerate responses."
            },
            {
              "chapter": "Relate the IRM concept to modern views of neural control and decision rules."
            }
          ]
        },
        {
          "lesson": "Imprinting and Sensitive-Period Learning",
          "lesson_key": "imprinting_and_sensitive_period_learning",
          "chapters": [
            {
              "chapter": "Define imprinting and distinguish filial imprinting from sexual imprinting."
            },
            {
              "chapter": "Explain sensitive/critical periods and how timing affects the permanence of imprinting."
            },
            {
              "chapter": "Discuss proximate mechanisms (sensory exposure, neurodevelopment) and ultimate functions (mate choice, parent-offspring cohesion)."
            }
          ]
        },
        {
          "lesson": "Learned Behavior: Non-Associative and Associative Learning",
          "lesson_key": "learned_behavior_non_associative_and_associative_learning",
          "chapters": [
            {
              "chapter": "Define learned behavior and explain why learning evolves under variable environments."
            },
            {
              "chapter": "Distinguish habituation and sensitization (non-associative) from classical and operant conditioning (associative)."
            },
            {
              "chapter": "Evaluate costs and constraints of learning (time, errors, neural investment) in an ecological context."
            }
          ]
        },
        {
          "lesson": "Proximate and Ultimate Questions in Classical Ethology",
          "lesson_key": "proximate_and_ultimate_questions_in_classical_ethology",
          "chapters": [
            {
              "chapter": "Differentiate proximate explanations (mechanism, development) from ultimate explanations (function, evolution)."
            },
            {
              "chapter": "Apply Tinbergen’s framework to instincts, FAPs, imprinting, and learned behavior."
            },
            {
              "chapter": "Avoid common category errors (e.g., treating function as mechanism) in exam-style answers."
            }
          ]
        }
      ]
    },
    {
      "topic": "Sensory Ecology",
      "topic_key": "sensory_ecology",
      "lessons": [
        {
          "lesson": "Sensory Ecology: Information, Environment, and Perception",
          "lesson_key": "sensory_ecology_information_environment_and_perception",
          "chapters": [
            {
              "chapter": "Define sensory ecology and explain why environments filter information."
            },
            {
              "chapter": "Distinguish information acquisition (sensing) from interpretation (perception) and action (behavior)."
            },
            {
              "chapter": "Relate habitat properties (light, turbulence, vegetation, substrate) to modality effectiveness."
            }
          ]
        },
        {
          "lesson": "Neuroethology: Neural Bases of Natural Behavior",
          "lesson_key": "neuroethology_neural_bases_of_natural_behavior",
          "chapters": [
            {
              "chapter": "Define neuroethology and identify its levels of analysis (sensory input, neural coding, circuits, motor output)."
            },
            {
              "chapter": "Explain stimulus filtering, feature detection, and sensory-to-motor transformations."
            },
            {
              "chapter": "Connect neural constraints to behavioral performance and evolution of signals."
            }
          ]
        },
        {
          "lesson": "Core Communication Framework: Signals, Cues, and Coevolution",
          "lesson_key": "core_communication_framework_signals_cues_and_coevolution",
          "chapters": [
            {
              "chapter": "Define signal, cue, sign stimulus, and receiver response in communication systems."
            },
            {
              "chapter": "Describe the sender–receiver model and how coevolution shapes both ends."
            },
            {
              "chapter": "Explain why signals can be honest, exaggerated, or deceptive under different constraints."
            }
          ]
        },
        {
          "lesson": "Chemical Communication: Production, Transport, and Detection",
          "lesson_key": "chemical_communication_production_transport_and_detection",
          "chapters": [
            {
              "chapter": "Explain how chemical signals are produced, carried (air/water/substrate), and detected."
            },
            {
              "chapter": "Describe pheromone functions (mate attraction, trail marking, alarm, aggregation) and ecological constraints."
            },
            {
              "chapter": "Analyze how plume structure, persistence, and background odors affect recognition and behavior."
            }
          ]
        },
        {
          "lesson": "Acoustic Communication: Signal Design and Habitat Acoustics",
          "lesson_key": "acoustic_communication_signal_design_and_habitat_acoustics",
          "chapters": [
            {
              "chapter": "Describe how acoustic signals are produced and how receivers detect and localize sound."
            },
            {
              "chapter": "Relate frequency, amplitude, and temporal structure to propagation and degradation in different habitats."
            },
            {
              "chapter": "Explain masking by ambient noise and behavioral/neural adaptations to improve detection."
            }
          ]
        },
        {
          "lesson": "Visual Communication: Perception, Contrast, and Light Environments",
          "lesson_key": "visual_communication_perception_contrast_and_light_environments",
          "chapters": [
            {
              "chapter": "Explain how light environment (intensity, spectrum, turbidity, canopy) affects visual signaling."
            },
            {
              "chapter": "Analyze signal design using contrast (chromatic/achromatic), motion, and pattern."
            },
            {
              "chapter": "Discuss receiver visual systems and perceptual biases relevant to signal evolution."
            }
          ]
        },
        {
          "lesson": "Recognition Systems: Templates, Learning, and Decision Rules",
          "lesson_key": "recognition_systems_templates_learning_and_decision_rules",
          "chapters": [
            {
              "chapter": "Define recognition systems and distinguish detection from recognition and discrimination."
            },
            {
              "chapter": "Explain mechanisms of recognition: innate templates, learned templates, phenotype matching, and familiarity."
            },
            {
              "chapter": "Apply recognition logic to species recognition, mate choice, kin recognition, and individual recognition."
            }
          ]
        }
      ]
    },
    {
      "topic": "Foraging Ecology",
      "topic_key": "foraging_ecology",
      "lessons": [
        {
          "lesson": "Foraging Ecology: What Foragers Do and Why It Matters",
          "lesson_key": "foraging_ecology_what_foragers_do_and_why_it_matters",
          "chapters": [
            {
              "chapter": "Define foraging behaviour and list its main components (search, choice, capture, handling, consumption)."
            },
            {
              "chapter": "Explain why foraging decisions affect fitness through energy, time, and survival."
            },
            {
              "chapter": "Identify ecological factors shaping foraging (resource distribution, competition, predation risk)."
            }
          ]
        },
        {
          "lesson": "Optimal Foraging Theory: Assumptions, Currencies, and Predictions",
          "lesson_key": "optimal_foraging_theory_assumptions_currencies_and_predictions",
          "chapters": [
            {
              "chapter": "State the core logic of OFT (maximize a currency subject to constraints)."
            },
            {
              "chapter": "Compare common currencies (net energy gain, rate of intake, nutrient balance, survival-adjusted gain)."
            },
            {
              "chapter": "Recognize key assumptions and when OFT predictions may fail."
            }
          ]
        },
        {
          "lesson": "Prey Choice and Diet Breadth (Optimal Diet Model)",
          "lesson_key": "prey_choice_and_diet_breadth_optimal_diet_model",
          "chapters": [
            {
              "chapter": "Define profitability and explain how handling time affects prey value."
            },
            {
              "chapter": "Explain the prey choice rule: accept or reject prey types to maximize long-term intake rate."
            },
            {
              "chapter": "Predict how diet breadth changes with encounter rates and prey availability."
            }
          ]
        },
        {
          "lesson": "Patch Use and the Marginal Value Theorem (MVT)",
          "lesson_key": "patch_use_and_the_marginal_value_theorem_mvt",
          "chapters": [
            {
              "chapter": "Explain why patch gain shows diminishing returns during exploitation."
            },
            {
              "chapter": "State the MVT departure rule in words and interpret it graphically."
            },
            {
              "chapter": "Predict effects of travel time, patch quality, and predation risk on patch residence time."
            }
          ]
        },
        {
          "lesson": "Beyond Simple OFT: Risk, State, and Central Place Constraints",
          "lesson_key": "beyond_simple_oft_risk_state_and_central_place_constraints",
          "chapters": [
            {
              "chapter": "Explain risk-sensitive foraging and when variance in reward becomes critical."
            },
            {
              "chapter": "Describe state-dependent decision-making based on energy reserves and future prospects."
            },
            {
              "chapter": "Explain central place foraging constraints and how they alter optimal choices."
            }
          ]
        },
        {
          "lesson": "Exam-Oriented Applications and Typical Question Patterns",
          "lesson_key": "exam_oriented_applications_and_typical_question_patterns",
          "chapters": [
            {
              "chapter": "Translate word problems into OFT components (currency, constraints, decision variable)."
            },
            {
              "chapter": "Answer common GATE-style conceptual questions on prey choice and patch leaving."
            },
            {
              "chapter": "Interpret qualitative graphs of intake rate vs time in patch and effects of parameter changes."
            }
          ]
        }
      ]
    },
    {
      "topic": "Reproduction",
      "topic_key": "reproduction",
      "lessons": [
        {
          "lesson": "Why Sex? Costs of Sexual Reproduction and Proposed Benefits",
          "lesson_key": "why_sex_costs_of_sexual_reproduction_and_proposed_benefits",
          "chapters": [
            {
              "chapter": "Define the major costs of sex, including the two-fold cost of males and costs of mating."
            },
            {
              "chapter": "Explain how recombination and segregation create both costs and potential advantages."
            },
            {
              "chapter": "Describe leading hypotheses for maintenance of sex (e.g., Red Queen, mutational clearance)."
            }
          ]
        },
        {
          "lesson": "Sexual Selection Basics: Sex Roles, Anisogamy, and Variance in Reproductive Success",
          "lesson_key": "sexual_selection_basics_sex_roles_anisogamy_and_variance_in_reproductive_success",
          "chapters": [
            {
              "chapter": "Distinguish sexual selection from natural selection and fecundity selection."
            },
            {
              "chapter": "Explain anisogamy and how it generates typical sex-role asymmetries."
            },
            {
              "chapter": "Use Bateman’s principle, OSR, and parental investment to predict competition vs choosiness."
            }
          ]
        },
        {
          "lesson": "Sexual Dimorphism: Origins and Interpretations",
          "lesson_key": "sexual_dimorphism_origins_and_interpretations",
          "chapters": [
            {
              "chapter": "Define sexual dimorphism across morphology, coloration, behavior, and life history."
            },
            {
              "chapter": "Explain multiple causes: sexual selection, fecundity selection, and ecological niche divergence."
            },
            {
              "chapter": "Connect dimorphism to mating system and intensity of competition."
            }
          ]
        },
        {
          "lesson": "Mate Choice: Decision Rules, Costs, and Benefits",
          "lesson_key": "mate_choice_decision_rules_costs_and_benefits",
          "chapters": [
            {
              "chapter": "Distinguish direct benefits (resources, protection) from indirect benefits (genetic quality)."
            },
            {
              "chapter": "Explain how sampling costs and predation risk affect choosiness."
            },
            {
              "chapter": "Describe preference functions and condition-dependent choice."
            }
          ]
        },
        {
          "lesson": "Models of Sexual Selection: Runaway, Good Genes, and Handicap Signaling",
          "lesson_key": "models_of_sexual_selection_runaway_good_genes_and_handicap_signaling",
          "chapters": [
            {
              "chapter": "Explain Fisherian runaway selection and the role of genetic correlation between trait and preference."
            },
            {
              "chapter": "Explain good-genes models and expected links between ornamentation and viability."
            },
            {
              "chapter": "Explain the handicap principle and why costs can enforce honesty."
            }
          ]
        },
        {
          "lesson": "Sexual Conflict and Antagonistic Coevolution",
          "lesson_key": "sexual_conflict_and_antagonistic_coevolution",
          "chapters": [
            {
              "chapter": "Define sexual conflict and distinguish intra-locus from inter-locus conflict."
            },
            {
              "chapter": "Describe pre-copulatory and post-copulatory conflict mechanisms."
            },
            {
              "chapter": "Explain antagonistic coevolution and potential outcomes (arms races, equilibria)."
            }
          ]
        },
        {
          "lesson": "Mating Systems: Ecological Drivers and Sexual Selection Consequences",
          "lesson_key": "mating_systems_ecological_drivers_and_sexual_selection_consequences",
          "chapters": [
            {
              "chapter": "Define monogamy, polygyny, polyandry, and promiscuity, and distinguish social vs genetic mating systems."
            },
            {
              "chapter": "Explain how resource distribution and parental care opportunities shape mating systems."
            },
            {
              "chapter": "Predict how mating system influences sexual dimorphism and sexual selection intensity."
            }
          ]
        },
        {
          "lesson": "Parental Care: Strategies, Trade-offs, and Conflicts",
          "lesson_key": "parental_care_strategies_trade_offs_and_conflicts",
          "chapters": [
            {
              "chapter": "Define parental care and distinguish forms (maternal, paternal, biparental, cooperative)."
            },
            {
              "chapter": "Explain trade-offs between current care and future reproduction."
            },
            {
              "chapter": "Explain parent–offspring conflict and sexual conflict over care."
            }
          ]
        }
      ]
    },
    {
      "topic": "Social Living",
      "topic_key": "social_living",
      "lessons": [
        {
          "lesson": "Social Living: Why Groups Form",
          "lesson_key": "social_living_why_groups_form",
          "chapters": [
            {
              "chapter": "Define social living and distinguish aggregations, groups, and societies."
            },
            {
              "chapter": "List major benefits and costs of group living and link them to fitness components."
            },
            {
              "chapter": "Predict when solitary living should be favored over grouping."
            }
          ]
        },
        {
          "lesson": "Group Living and Predators: Mechanisms and Responses",
          "lesson_key": "group_living_and_predators_mechanisms_and_responses",
          "chapters": [
            {
              "chapter": "Explain dilution, many-eyes, and confusion effects and how they scale with group size."
            },
            {
              "chapter": "Describe coordinated responses to predators (alarm calls, sentinels, mobbing, synchronized escape)."
            },
            {
              "chapter": "Relate predator pressure to grouping tendency and vigilance time budgets."
            }
          ]
        },
        {
          "lesson": "Competition and Group Formation: Scramble vs Contest",
          "lesson_key": "competition_and_group_formation_scramble_vs_contest",
          "chapters": [
            {
              "chapter": "Distinguish scramble (exploitation) and contest (interference) competition with examples."
            },
            {
              "chapter": "Predict how each competition type affects optimal group size and within-group inequality."
            },
            {
              "chapter": "Explain why fission–fusion dynamics can emerge under variable resources."
            }
          ]
        },
        {
          "lesson": "Dominance Relationships and Hierarchies",
          "lesson_key": "dominance_relationships_and_hierarchies",
          "chapters": [
            {
              "chapter": "Define dominance and describe common hierarchy structures (linear, despotic, egalitarian)."
            },
            {
              "chapter": "Explain how dominance can reduce repeated fighting and stabilize resource access."
            },
            {
              "chapter": "Describe mechanisms establishing rank: assessment signals, winner–loser effects, alliances, kinship."
            }
          ]
        },
        {
          "lesson": "Kin Selection and Inclusive Fitness",
          "lesson_key": "kin_selection_and_inclusive_fitness",
          "chapters": [
            {
              "chapter": "Define inclusive fitness and distinguish direct vs indirect fitness."
            },
            {
              "chapter": "State and interpret Hamilton’s rule \\( rB > C \\)."
            },
            {
              "chapter": "Apply kin selection logic to predict when altruism toward relatives is favored."
            }
          ]
        },
        {
          "lesson": "Altruism and Cooperation: Mechanisms Beyond Kin",
          "lesson_key": "altruism_and_cooperation_mechanisms_beyond_kin",
          "chapters": [
            {
              "chapter": "Differentiate altruism, mutualism, and by-product benefits."
            },
            {
              "chapter": "Explain reciprocity and conditions required for its stability (repeated interactions, recognition, low cheating)."
            },
            {
              "chapter": "Describe how policing, punishment, and partner choice reduce cheating."
            }
          ]
        },
        {
          "lesson": "Eusociality: Evolution of Extreme Social Systems",
          "lesson_key": "eusociality_evolution_of_extreme_social_systems",
          "chapters": [
            {
              "chapter": "Define eusociality (reproductive division of labor, cooperative brood care, overlapping generations)."
            },
            {
              "chapter": "Explain the role of relatedness and mating structure (e.g., monogamy) in facilitating eusociality."
            },
            {
              "chapter": "Describe ecological drivers (fortress defense, progressive provisioning) and conflict control (policing)."
            }
          ]
        },
        {
          "lesson": "Human Behaviour: Cooperation, Conflict, and Culture",
          "lesson_key": "human_behaviour_cooperation_conflict_and_culture",
          "chapters": [
            {
              "chapter": "Apply evolutionary concepts (kin selection, reciprocity, sexual selection) to human social behavior cautiously."
            },
            {
              "chapter": "Explain how culture and institutions can change payoffs and stabilize cooperation."
            },
            {
              "chapter": "Describe gene–culture coevolution and how norms can mimic enforcement mechanisms."
            }
          ]
        }
      ]
    },
    {
      "topic": "Biodiversity and Conservation",
      "topic_key": "biodiversity_and_conservation",
      "lessons": [
        {
          "lesson": "Biodiversity fundamentals and why conservation matters",
          "lesson_key": "biodiversity_fundamentals_and_why_conservation_matters",
          "chapters": [
            {
              "chapter": "Define biodiversity at genetic, species, and ecosystem levels and distinguish between them."
            },
            {
              "chapter": "Explain ecological and evolutionary reasons for conserving biodiversity (stability, resilience, option value)."
            },
            {
              "chapter": "Interpret common biodiversity metrics at a qualitative level (richness vs evenness vs endemism)."
            }
          ]
        },
        {
          "lesson": "Ecosystem services: categories, mechanisms, and valuation",
          "lesson_key": "ecosystem_services_categories_mechanisms_and_valuation",
          "chapters": [
            {
              "chapter": "Classify ecosystem services into provisioning, regulating, cultural, and supporting services."
            },
            {
              "chapter": "Connect biodiversity components to service delivery using clear causal reasoning."
            },
            {
              "chapter": "Apply basic valuation logic used in conservation decisions (trade-offs, externalities)."
            }
          ]
        },
        {
          "lesson": "Threats to biodiversity: drivers, patterns, and interactions",
          "lesson_key": "threats_to_biodiversity_drivers_patterns_and_interactions",
          "chapters": [
            {
              "chapter": "List and explain major threat categories and their mechanisms of impact."
            },
            {
              "chapter": "Differentiate habitat loss from fragmentation and relate each to population processes."
            },
            {
              "chapter": "Recognize synergistic effects among threats (e.g., climate change + fragmentation)."
            }
          ]
        },
        {
          "lesson": "Invasive species: invasion process, impacts, and management",
          "lesson_key": "invasive_species_invasion_process_impacts_and_management",
          "chapters": [
            {
              "chapter": "Describe stages of biological invasion: introduction, establishment, spread, impact."
            },
            {
              "chapter": "Explain ecological impacts on native species, communities, and ecosystem processes."
            },
            {
              "chapter": "Compare prevention, eradication, containment, and control as management strategies."
            }
          ]
        },
        {
          "lesson": "In-situ conservation: endemism, hotspots, and protected areas",
          "lesson_key": "in_situ_conservation_endemism_hotspots_and_protected_areas",
          "chapters": [
            {
              "chapter": "Define endemism and explain why endemics elevate conservation priority."
            },
            {
              "chapter": "Explain biodiversity hotspots: criteria, significance, and limitations."
            },
            {
              "chapter": "Compare protected area categories and describe core principles of reserve design."
            }
          ]
        },
        {
          "lesson": "Ex-situ conservation: tools, genetics, and reintroduction",
          "lesson_key": "ex_situ_conservation_tools_genetics_and_reintroduction",
          "chapters": [
            {
              "chapter": "List major ex-situ methods and state when each is appropriate."
            },
            {
              "chapter": "Explain genetic and demographic challenges in captive or banked populations."
            },
            {
              "chapter": "Outline core steps and risks in reintroduction and supplementation programs."
            }
          ]
        },
        {
          "lesson": "Conservation genetics: diversity, inbreeding depression, and managing small populations",
          "lesson_key": "conservation_genetics_diversity_inbreeding_depression_and_managing_small_populations",
          "chapters": [
            {
              "chapter": "Define genetic diversity and explain how drift, selection, and gene flow shape it."
            },
            {
              "chapter": "Explain inbreeding depression mechanistically and predict when it is most severe."
            },
            {
              "chapter": "Use the idea of effective population size to reason about extinction risk and genetic management."
            }
          ]
        },
        {
          "lesson": "Molecular tools in conservation: DNA fingerprinting and DNA barcoding",
          "lesson_key": "molecular_tools_in_conservation_dna_fingerprinting_and_dna_barcoding",
          "chapters": [
            {
              "chapter": "Distinguish DNA fingerprinting (individual identification) from DNA barcoding (species identification)."
            },
            {
              "chapter": "Describe typical markers and workflows used in each approach at a conceptual level."
            },
            {
              "chapter": "Explain key conservation applications: wildlife forensics, monitoring trade, population assignment, and biodiversity surveys."
            }
          ]
        }
      ]
    },
    {
      "topic": "Disease Ecology and Evolution",
      "topic_key": "disease_ecology_and_evolution",
      "lessons": [
        {
          "lesson": "Epidemiology basics: measures, routes, and outbreak logic",
          "lesson_key": "epidemiology_basics_measures_routes_and_outbreak_logic",
          "chapters": [
            {
              "chapter": "Define incidence, prevalence, mortality, case fatality rate, and attack rate."
            },
            {
              "chapter": "Differentiate direct, indirect, airborne, fecal–oral, and vector-borne transmission."
            },
            {
              "chapter": "Explain surveillance goals and interpret common epidemic curves qualitatively."
            }
          ]
        },
        {
          "lesson": "Transmission dynamics: SIR/SEIR models, \\(R_0\\), and herd immunity",
          "lesson_key": "transmission_dynamics_sir_seir_models_r_0_and_herd_immunity",
          "chapters": [
            {
              "chapter": "Explain compartment models (SIS, SIR, SEIR) and when each is appropriate."
            },
            {
              "chapter": "Interpret \\(R_0\\) and relate it to outbreak potential and control intensity."
            },
            {
              "chapter": "Describe herd immunity and qualitatively derive the herd immunity threshold."
            }
          ]
        },
        {
          "lesson": "Zoonotic diseases: spillover, reservoirs, and emergence",
          "lesson_key": "zoonotic_diseases_spillover_reservoirs_and_emergence",
          "chapters": [
            {
              "chapter": "Define zoonosis, reservoir host, spillover, and dead-end host."
            },
            {
              "chapter": "Explain ecological drivers of spillover (land-use change, wildlife trade, livestock intensification)."
            },
            {
              "chapter": "Describe barriers to host switching and how pathogens adapt to new hosts."
            }
          ]
        },
        {
          "lesson": "Evolution in real time: virulence evolution and antibiotic resistance",
          "lesson_key": "evolution_in_real_time_virulence_evolution_and_antibiotic_resistance",
          "chapters": [
            {
              "chapter": "Explain core hypotheses for virulence evolution using transmission–virulence trade-offs."
            },
            {
              "chapter": "Describe how antibiotic use selects for resistance and how resistance spreads."
            },
            {
              "chapter": "Compare mutation-driven resistance with horizontal gene transfer mechanisms."
            }
          ]
        },
        {
          "lesson": "Vector ecology and vector control",
          "lesson_key": "vector_ecology_and_vector_control",
          "chapters": [
            {
              "chapter": "Define vector competence, vector capacity, and the ecological determinants of transmission."
            },
            {
              "chapter": "Identify points in the vector life cycle where interventions act."
            },
            {
              "chapter": "Compare chemical, biological, environmental, and genetic control strategies and their trade-offs."
            }
          ]
        },
        {
          "lesson": "Breeding in plants and animals: genetic basis of traits",
          "lesson_key": "breeding_in_plants_and_animals_genetic_basis_of_traits",
          "chapters": [
            {
              "chapter": "Differentiate qualitative (Mendelian) traits from quantitative (polygenic) traits."
            },
            {
              "chapter": "Explain heritability conceptually and relate it to response to selection."
            },
            {
              "chapter": "Describe genotype-by-environment interaction and its implications for breeding."
            }
          ]
        },
        {
          "lesson": "Marker-assisted breeding: QTLs, markers, and selection schemes",
          "lesson_key": "marker_assisted_breeding_qtls_markers_and_selection_schemes",
          "chapters": [
            {
              "chapter": "Explain the logic of linkage and how markers track favorable alleles."
            },
            {
              "chapter": "Describe QTL mapping and association approaches at a conceptual level."
            },
            {
              "chapter": "Choose suitable marker-assisted strategies (MAS, MABC, pyramiding) for target traits."
            }
          ]
        }
      ]
    },
    {
      "topic": "Global Climate Change",
      "topic_key": "global_climate_change",
      "lessons": [
        {
          "lesson": "Climate system foundations: greenhouse effect and energy balance",
          "lesson_key": "climate_system_foundations_greenhouse_effect_and_energy_balance",
          "chapters": [
            {
              "chapter": "Explain Earth’s energy balance and the greenhouse effect using radiative forcing language."
            },
            {
              "chapter": "Define albedo and describe how changes in ice, clouds, and land cover affect climate."
            },
            {
              "chapter": "Identify key components of the climate system and their timescales (atmosphere vs ocean vs cryosphere)."
            }
          ]
        },
        {
          "lesson": "Causes of modern climate change: drivers and attribution",
          "lesson_key": "causes_of_modern_climate_change_drivers_and_attribution",
          "chapters": [
            {
              "chapter": "List major anthropogenic drivers: greenhouse gases, land-use change, and aerosols."
            },
            {
              "chapter": "Contrast anthropogenic drivers with natural drivers (solar variability, volcanism) and internal variability."
            },
            {
              "chapter": "Explain the basic logic of attribution: why observed trends match human forcing patterns."
            }
          ]
        },
        {
          "lesson": "Carbon cycle and greenhouse gases: reservoirs, lifetimes, and warming impact",
          "lesson_key": "carbon_cycle_and_greenhouse_gases_reservoirs_lifetimes_and_warming_impact",
          "chapters": [
            {
              "chapter": "Describe the fast and slow carbon cycle and major reservoirs."
            },
            {
              "chapter": "Compare CO\\(_2\\), CH\\(_4\\), and N\\(_2\\)O in terms of sources, lifetimes, and warming influence."
            },
            {
              "chapter": "Explain why cumulative CO\\(_2\\) emissions link to long-term warming (carbon budget idea)."
            }
          ]
        },
        {
          "lesson": "Consequences I: physical impacts and extremes",
          "lesson_key": "consequences_i_physical_impacts_and_extremes",
          "chapters": [
            {
              "chapter": "Describe observed and expected changes in temperature and precipitation patterns."
            },
            {
              "chapter": "Explain mechanisms behind sea-level rise and ocean acidification."
            },
            {
              "chapter": "Connect warming to changes in extreme events (heatwaves, heavy rainfall, drought risk) conceptually."
            }
          ]
        },
        {
          "lesson": "Consequences II: ecological and evolutionary responses",
          "lesson_key": "consequences_ii_ecological_and_evolutionary_responses",
          "chapters": [
            {
              "chapter": "Predict typical biological responses: range shifts, phenology shifts, and community reassembly."
            },
            {
              "chapter": "Explain how climate change affects extinction risk through exposure, sensitivity, and adaptive capacity."
            },
            {
              "chapter": "Relate climate stressors to ecosystem processes (productivity, disturbance, carbon storage)."
            }
          ]
        },
        {
          "lesson": "Mitigation: reducing emissions across sectors",
          "lesson_key": "mitigation_reducing_emissions_across_sectors",
          "chapters": [
            {
              "chapter": "Differentiate mitigation from adaptation and list primary mitigation levers."
            },
            {
              "chapter": "Explain decarbonization strategies for power, transport, industry, buildings, and agriculture."
            },
            {
              "chapter": "Describe methane mitigation and why it has strong near-term benefits."
            }
          ]
        },
        {
          "lesson": "Mitigation: carbon removal, natural climate solutions, and trade-offs",
          "lesson_key": "mitigation_carbon_removal_natural_climate_solutions_and_trade_offs",
          "chapters": [
            {
              "chapter": "Describe major CDR approaches and their constraints (cost, land, energy, permanence)."
            },
            {
              "chapter": "Explain why land-based mitigation links strongly to biodiversity and ecosystem services."
            },
            {
              "chapter": "Evaluate trade-offs and risks, including governance concerns for high-leverage interventions."
            }
          ]
        }
      ]
    }
  ]
}